//---------------------------------------------------------------------------

#include <vcl.h>
#pragma hdrstop

#include "Reference.h"
//---------------------------------------------------------------------------
#pragma package(smart_init)
#pragma resource "*.dfm"
TForm3 *Form3;
//---------------------------------------------------------------------------
__fastcall TForm3::TForm3(TComponent* Owner)
        : TForm(Owner)
{
}
//---------------------------------------------------------------------------


void __fastcall TForm3::FormCreate(TObject *Sender)
{
Label1->Caption = "  1. Для просмотра углограммы по всей длине воспользуйтесь полосой прокрутки\n";
Label1->Caption =Label1->Caption+ "   2.Масштаб рисунка для соответсвующей оси может быть изменен с помощью кнопок 'вверх-вниз'.\n Текущий коэффициент масштаба отражается на поле рядом с кнопками\n";
Label1->Caption =Label1->Caption +"   3.Для установки режима центровки графика, необходимо нажать кнопку 'Центр', она зафиксируется в нажатом  состоянии.\n";
Label1->Caption =Label1->Caption +"    Теперь можно передвигать курсор в  нужном  направлении.\n При этом график  будет  перемещаться вместе с курсором\n";
Label1->Caption = Label1->Caption+"   4.Для возвращения к исходному состоянию нужно нажать кнопку 'Отмена'\n";
Label1->Caption =Label1->Caption+ "   5.Для выхода из режима центровки, необходимо снова нажать\n";
Label1->Caption =Label1->Caption +"   кнопку 'Центр', она вернется в исходное состояние\n";
Label1->Caption =Label1->Caption+ "   6.Задача в том, чтобы задать прямые. Каждая прямая должна быть отмечена двумя точками\n Для этого дважды щелкните левой кнопкой мыши по нужной точке\n";
Label1->Caption =Label1->Caption +"   7.На начальной прямой надо щёлкнуть начальную и ещё одну точку.\nДалее отмечать точки последовательно, двигаясь вправо по графику\n";
Label1->Caption =Label1->Caption +"   8.На длинных прямых нужно отметить две  любые точки, в которых нет перелома графика\n";
Label1->Caption =Label1->Caption +"   9.На коротких прямых нужно отметить точки с минимальным переломом графика\n";
Label1->Caption = Label1->Caption+"  10.Последняя прямая должна  быть отмечена по тем же правилам \n";
Label1->Caption =Label1->Caption +"  11.После того, как отмечены все прямые, необходимо нажать кнопку 'Рассчитать'\n ";
Label1->Caption =Label1->Caption +"  12.Однократным щелчком левой кнопки мыши по точке съёмки можно увидеть угол \n";
Label1->Caption =Label1->Caption +"     или радиус, переключая индикатор 'Показать' внизу экрана";
}
//---------------------------------------------------------------------------


//---------------------------------------------------------------------------
void __fastcall TForm3::btnCloseClick(TObject *Sender)
{
 Form3->Close();
}
//---------------------------------------------------------------------------




//---------------------------------------------------------------------------


//---------------------------------------------------------------------------

