//---------------------------------------------------------------------------

#include <vcl.h>
#pragma hdrstop

#include "Reference.h"
//---------------------------------------------------------------------------
#pragma package(smart_init)
#pragma resource "*.dfm"
TForm3 *Form3;
//---------------------------------------------------------------------------
__fastcall TForm3::TForm3(TComponent* Owner)
        : TForm(Owner)
{
}
//---------------------------------------------------------------------------


void __fastcall TForm3::FormCreate(TObject *Sender)
{
   Label1->Caption = "1. Для просмотра углограммы по всей длине воспользуйтесь полосой прокрутки\n";
   Label1->Caption = Label1->Caption + "2. Масштаб рисунка для соответсвующей оси может быть изменен с помощью кнопок 'вверх-вниз'.\nТекущий коэффициент масштаба отражается на поле рядом с кнопками\n";
   Label1->Caption = Label1->Caption + "3. Чтобы установить границу участка, дважды щелкните левой кнопкой мыши на том месте, где должна быть установлена граница\n";
   Label1->Caption = Label1->Caption + "4. Чтобы начать рабоу с границей, ее нужно выделить. Для выделения границы щелкните по ней левой клавишой мыши.\nЕсли выбрана граница, становятся доступным кнопочное меню в правой части окна. Чтобы вызвать контексное меню, щелкните правой кнопкой мыши на поле графика. Элементы контексного меню также доступны только при выбранной границе.\n";
   Label1->Caption = Label1->Caption + "5. Кнопка (пункт контекстного меню) 'Отменить выделение' снимает выделение с границы без ее изменения\n";
   Label1->Caption = Label1->Caption + "6. Кнопка (пункт контекстного  меню) 'Удалить' удаляет выделенную границу\n";
   Label1->Caption = Label1->Caption + "7. Кнопка (пункт контекстного  меню) 'Переместить' включает режим перемещения выделенной границы. Чтобы завершить перемещение, щелкните левой кнопкой мыши на новом месте расположения границы\n";
   Label1->Caption = Label1->Caption + "8. Кнопка 'Сохранить' осуществляет запись даннных о границах в фаил\n";
   Label1->Caption = Label1->Caption + "9. Чтобы отобразить проектную углограмму, установите флажок 'Показать проектную углограмму'";
   Label1->Caption = Label1->Caption + "\n10. Для установки режима центровки графика, необходимо нажать кнопку 'Центр', она зафиксируется в нажатом  состоянии.\n"
                                       "Затем,установите курсор мыши в любой точке изображения. Нажав, и, удерживая нажатой левую кнопку мыши,\n"
                                       "передвигать курсор в  нужном нам направлении, при этом график  также,одновременно, будет  перемещаться вместе с мышью\n"
                                       "11. Для возвращения к стандартной центровке нужно нажать кнопку 'Отмена'"
                                       "\n12. Для выхода из режима центровки, необходимо снова нажать"
                                       "\nкнопку 'Центр', она вернется в исходное состояние";


}
//---------------------------------------------------------------------------

/*void __fastcall TForm3::FormShow(TObject *Sender)
{
   Label1->Caption = "1. Для просмотра углограммы по всей длине воспользуйтесь полосой прокрутки\n";
   Label1->Caption+="2. Масштаб рисунка для соответсвующей оси может быть изменен с помощью кнопок 'вверх-вниз'.\nТекущий коэффициент масштаба отражается на поле рядом с кнопками\n";
   Label1->Caption+="3. Чтобы установить границу участка, дважды щелкните левой кнопкой мыши на том месте, где должна быть установлена граница\n";
   Label1->Caption+="4. Чтобы начать рабоу с границей, ее нужно выделить. Для выделения границы щелкните по ней левой клавишой мыши.\nЕсли выбрана граница, становятся доступным кнопочное меню в правой части окна. Чтобы вызвать контексное меню, щелкните правой кнопкой мыши на поле графика. Элементы контексного меню также доступны только при выбранной границе.\n";
   Label1->Caption+="5. Кнопка (пункт контекстного меню) 'Отменить выделение' снимает выделение с границы без ее изменения\n";
   Label1->Caption+="6. Кнопка (пункт контекстного  меню) 'Удалить' удаляет выделенную границу\n";
   Label1->Caption+="7. Кнопка (пункт контекстного  меню) 'Переместить' включает режим перемещения выделенной границы. Чтобы завершить перемещение, щелкните левой кнопкой мыши на новом месте расположения границы\n";
   Label1->Caption+="8. Кнопка 'Сохранить' осуществляет запись даннных о границах в фаил\n";
}*/
//---------------------------------------------------------------------------
void __fastcall TForm3::btnCloseClick(TObject *Sender)
{
 Form3->Close();
}
//---------------------------------------------------------------------------


